# Terraform environment test
#### Format and Style 🖌`success`
#### Initialization ⚙️`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Truncated to 120000 bytes! See logoutput for complete plan]
Acquiring state lock. This may take a few moments...
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1mMDNmNzU3OS01ZjM5LTRkN2YtYmNlYS04ZTVjYjZkN2FjYTQ7b2JqZWN0SWQ9MDJiMTdkMjgtN2VjOC00MDg0LTkyY2UtZDI2MDUxZmE0OTk4O3N1YnNjcmlwdGlvbklkPTFjZThlOWFmLWMyZDYtNDRlNy05YzVlLTA5OWEzMDgwNTZmZTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.azurerm_kubernetes_cluster.k6tests will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_kubernetes_cluster" "k6tests" {
      + aci_connector_linux                              = (known after apply)
      + agent_pool_profile                               = (known after apply)
      + api_server_authorized_ip_ranges                  = (known after apply)
      + azure_active_directory_role_based_access_control = (known after apply)
      + azure_policy_enabled                             = (known after apply)
      + current_kubernetes_version                       = (known after apply)
      + disk_encryption_set_id                           = (known after apply)
      + dns_prefix                                       = (known after apply)
      + fqdn                                             = (known after apply)
      + http_application_routing_enabled                 = (known after apply)
      + http_application_routing_zone_name               = (known after apply)
      + id                                               = (known after apply)
      + identity                                         = (known after apply)
      + ingress_application_gateway                      = (known after apply)
      + key_management_service                           = (known after apply)
      + key_vault_secrets_provider                       = (known after apply)
      + kube_admin_config                                = (sensitive value)
      + kube_admin_config_raw                            = (sensitive value)
      + kube_config                                      = (sensitive value)
      + kube_config_raw                                  = (sensitive value)
      + kubelet_identity                                 = (known after apply)
      + kubernetes_version                               = (known after apply)
      + linux_profile                                    = (known after apply)
      + location                                         = (known after apply)
      + microsoft_defender                               = (known after apply)
      + name                                             = "k6tests-cluster-F7sT"
      + network_profile                                  = (known after apply)
      + node_resource_group                              = (known after apply)
      + node_resource_group_id                           = (known after apply)
      + oidc_issuer_enabled                              = (known after apply)
      + oidc_issuer_url                                  = (known after apply)
      + oms_agent                                        = (known after apply)
      + open_service_mesh_enabled                        = (known after apply)
      + private_cluster_enabled                          = (known after apply)
      + private_fqdn                                     = (known after apply)
      + resource_group_name                              = "k6tests-rg-F7sT"
      + role_based_access_control_enabled                = (known after apply)
      + service_mesh_profile                             = (known after apply)
      + service_principal                                = (known after apply)
      + storage_profile                                  = (known after apply)
      + tags                                             = (known after apply)
      + windows_profile                                  = (known after apply)
    }

  # data.azurerm_monitor_data_collection_endpoint.k6tests will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_data_collection_endpoint" "k6tests" {
      + configuration_access_endpoint = (known after apply)
      + description                   = (known after apply)
      + id                            = (known after apply)
      + immutable_id                  = (known after apply)
      + kind                          = (known after apply)
      + location                      = (known after apply)
      + logs_ingestion_endpoint       = (known after apply)
      + metrics_ingestion_endpoint    = (known after apply)
      + name                          = "k6tests-amw-F7sT"
      + public_network_access_enabled = (known after apply)
      + resource_group_name           = "MA_k6tests-amw-F7sT_norwayeast_managed"
      + tags                          = (known after apply)
    }

  # data.azurerm_monitor_data_collection_rule.k6tests will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_data_collection_rule" "k6tests" {
      + data_collection_endpoint_id = (known after apply)
      + data_flow                   = (known after apply)
      + data_sources                = (known after apply)
      + description                 = (known after apply)
      + destinations                = (known after apply)
      + id                          = (known after apply)
      + identity                    = (known after apply)
      + immutable_id                = (known after apply)
      + kind                        = (known after apply)
      + location                    = (known after apply)
      + name                        = "k6tests-dcr-F7sT"
      + resource_group_name         = "k6tests-rg-F7sT"
      + stream_declaration          = (known after apply)
      + tags                        = (known after apply)
    }

  # module.foundational.azurerm_kubernetes_cluster_node_pool.prometheus will be updated in-place
  ~ resource "azurerm_kubernetes_cluster_node_pool" "prometheus" {
        id                            = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/k6tests-rg-F7sT/providers/Microsoft.ContainerService/managedClusters/k6tests-cluster-F7sT/agentPools/prometheus"
        name                          = "prometheus"
        tags                          = {}
        # (31 unchanged attributes hidden)

      - upgrade_settings {
          - drain_timeout_in_minutes      = 0 -> null
          - max_surge                     = "10%" -> null
          - node_soak_duration_in_minutes = 0 -> null
        }
    }

  # module.services.azuread_application_federated_identity_credential.prometheus will be updated in-place
  ~ resource "azuread_application_federated_identity_credential" "prometheus" {
        id             = "14406d89-2c70-4bb9-96c4-252f667156ff/federatedIdentityCredential/6a72038e-3832-451a-9b3c-e5121f92e1ae"
      ~ issuer         = "https://norwayeast.oic.prod-aks.azure.com/cd0026d8-283b-4a55-9bfa-d0ef4a8ba21c/ad6108ad-c807-45af-9f6e-7807f38ff4ea/" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.services.azurerm_role_assignment.monitoring_metrics_publisher must be replaced
-/+ resource "azurerm_role_assignment" "monitoring_metrics_publisher" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/MA_k6tests-amw-F7sT_norwayeast_managed/providers/Microsoft.Insights/dataCollectionEndpoints/k6tests-amw-F7sT/providers/Microsoft.Authorization/roleAssignments/5bd407d9-44a9-3a3d-a507-ffdccd4ac4f5" -> (known after apply)
      ~ name                                   = "5bd407d9-44a9-3a3d-a507-ffdccd4ac4f5" -> (known after apply)
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/providers/Microsoft.Authorization/roleDefinitions/3913510d-42f4-4e42-8a64-420c390055eb" -> (known after apply)
      ~ scope                                  = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/MA_k6tests-amw-F7sT_norwayeast_managed/providers/Microsoft.Insights/dataCollectionEndpoints/k6tests-amw-F7sT" -> (known after apply) # forces replacement
      + skip_service_principal_aad_check       = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.services.helm_release.k6_operator will be updated in-place
  ~ resource "helm_release" "k6_operator" {
      ~ id                         = "k6-operator" -> (known after apply)
      ~ metadata                   = {
          ~ app_version    = "0.0.21" -> (known after apply)
          ~ chart          = "k6-operator" -> (known after apply)
          ~ first_deployed = 1744372041 -> (known after apply)
          ~ last_deployed  = 1750861909 -> (known after apply)
          ~ name           = "k6-operator" -> (known after apply)
          ~ namespace      = "k6-operator-system" -> (known after apply)
          ~ notes          = <<-EOT
                Thank you for installing k6-operator.
                
                Your release is named k6-operator.
                
                To learn more about the release, try:
                
                  $ helm status k6-operator
                  $ helm get all k6-operator
            EOT -> (known after apply)
          ~ revision       = 3 -> (known after apply)
          ~ values         = jsonencode(
                {
                  - installCRDs = true
                  - namespace   = {
                      - create = false
                    }
                }
            ) -> (known after apply)
          ~ version        = "3.13.1" -> (known after apply)
        } -> (known after apply)
        name                       = "k6-operator"
      ~ version                    = "3.13.1" -> "3.14.2"
        # (27 unchanged attributes hidden)
    }

  # module.services.helm_release.kube_prometheus_stack will be updated in-place
  ~ resource "helm_release" "kube_prometheus_stack" {
      ~ id                         = "kube-prometheus-stack" -> (known after apply)
      ~ metadata                   = {
          ~ app_version    = "v0.83.0" -> (known after apply)
          ~ chart          = "kube-prometheus-stack" -> (known after apply)
          ~ first_deployed = 1744372042 -> (known after apply)
          ~ last_deployed  = 1750860370 -> (known after apply)
          ~ name           = "kube-prometheus-stack" -> (known after apply)
          ~ namespace      = "monitoring" -> (known after apply)
          ~ notes          = <<-EOT
                1. Get the application URL by running these commands:
                  export POD_NAME=$(kubectl get pods --namespace monitoring -l "app.kubernetes.io/name=prometheus-node-exporter,app.kubernetes.io/instance=kube-prometheus-stack" -o jsonpath="{.items[0].metadata.name}")
                  echo "Visit http://127.0.0.1:9100 to use your application"
                  kubectl port-forward --namespace monitoring $POD_NAME 9100
                kube-state-metrics is a simple service that listens to the Kubernetes API server and generates metrics about the state of the objects.
                The exposed metrics can be found here:
                https://github.com/kubernetes/kube-state-metrics/blob/master/docs/README.md#exposed-metrics
                
                The metrics are exported on the HTTP endpoint /metrics on the listening port.
                In your case, kube-prometheus-stack-kube-state-metrics.monitoring.svc.cluster.local:8080/metrics
                
                They are served either as plaintext or protobuf depending on the Accept header.
                They are designed to be consumed either by Prometheus itself or by a scraper that is compatible with scraping a Prometheus client endpoint.
                
                kube-prometheus-stack has been installed. Check its status by running:
                  kubectl --namespace monitoring get pods -l "release=kube-prometheus-stack"
                
                Get Grafana 'admin' user password by running:
                
                  kubectl --namespace monitoring get secrets kube-prometheus-stack-grafana -o jsonpath="{.data.admin-password}" | base64 -d ; echo
                
                Access Grafana local instance:
                
                  export POD_NAME=$(kubectl --namespace monitoring get pod -l "app.kubernetes.io/name=grafana,app.kubernetes.io/instance=kube-prometheus-stack" -oname)
                  kubectl --namespace monitoring port-forward $POD_NAME 3000
                
                Visit https://github.com/prometheus-operator/kube-prometheus for instructions on how to create & configure Alertmanager and Prometheus instances using the Operator.
            EOT -> (known after apply)
          ~ revision       = 3 -> (known after apply)
          ~ values         = jsonencode(
                {
                  - alertmanager = {
                      - enabled = true
                    }
                  - crds         = {
                      - enabled = false
                    }
                  - grafana      = {
                      - enabled = false
                    }
                  - prometheus   = {
                      - enabled        = true
                      - prometheusSpec = {
                          - enableRemoteWriteReceiver = true
                          - externalLabels            = {
                              - cluster = "k6tests-cluster-F7sT"
                            }
                          - nodeSelector              = {
                              - workload = "prometheus"
                            }
                          - podMetadata               = {
                              - labels = {
                                  - "azure.workload.identity/use" = "true"
                                }
                            }
                          - priorityClassName         = "system-cluster-critical"
                          - remoteWrite               = [
                              - {
                                  - azureAd = {
                                      - cloud = "AzurePublic"
                                      - sdk   = {
                                          - tenantId = "cd0026d8-283b-4a55-9bfa-d0ef4a8ba21c"
                                        }
                                    }
                                  - url     = "https://k6tests-amw-f7st-jewy.norwayeast-1.metrics.ingest.monitor.azure.com/dataCollectionRules/dcr-e1d754e0800647b6930fc57a08aa3c7c/streams/Microsoft-PrometheusMetrics/api/v1/write?api-version=2023-04-24"
                                },
                            ]
                          - resources                 = {
                              - requests = {
                                  - memory = "8Gi"
                                }
                            }
                          - retention                 = "8d"
                          - storageSpec               = {
                              - volumeClaimTemplate = {
                                  - spec = {
                                      - resources = {
                                          - requests = {
                                              - storage = "64Gi"
                                            }
                                        }
                                    }
                                }
                            }
                          - tolerations               = [
                              - {
                                  - effect   = "NoSchedule"
                                  - key      = "workload"
                                  - operator = "Equal"
                                  - value    = "prometheus"
                                },
                            ]
                        }
                      - serviceAccount = {
                          - annotations = {
                              - "azure.workload.identity/client-id" = "0626b615-9933-46fc-84ec-b08ad8bb1b79"
                            }
                        }
                    }
                }
            ) -> (known after apply)
          ~ version        = "75.4.0" -> (known after apply)
        } -> (known after apply)
        name                       = "kube-prometheus-stack"
      ~ values                     = [
          ~ <<-EOT
                crds:
                  enabled: false
                alertmanager:
                  enabled: true
                grafana:
                  enabled: false
                prometheus:
                  enabled: true
                  serviceAccount:
                    annotations:
                      azure.workload.identity/client-id: "0626b615-9933-46fc-84ec-b08ad8bb1b79"
                  prometheusSpec:
                    podMetadata:
                      labels:
                        azure.workload.identity/use: "true"
                    externalLabels:
                      cluster: "k6tests-cluster-F7sT"
                    enableRemoteWriteReceiver: true
                    remoteWrite:
                      - url: "https://k6tests-amw-f7st-jewy.norwayeast-1.metrics.ingest.monitor.azure.com/dataCollectionRules/dcr-e1d754e0800647b6930fc57a08aa3c7c/streams/Microsoft-PrometheusMetrics/api/v1/write?api-version=2023-04-24"
                        azureAd:
                          cloud: "AzurePublic"
                          sdk:
                            tenantId: "cd0026d8-283b-4a55-9bfa-d0ef4a8ba21c"
                    tolerations:
                      - key: "workload"
                        operator: "Equal"
                        value: "prometheus"
                        effect: "NoSchedule"
                    resources:
                      requests:
                        memory: 8Gi
                    nodeSelector:
                      workload: "prometheus"
                    priorityClassName: "system-cluster-critical"
                    retention: 8d
                    storageSpec:
                      volumeClaimTemplate:
                        spec:
                          resources:
                            requests:
                              storage: 64Gi
            EOT -> (known after apply),
        ]
      ~ version                    = "75.4.0" -> "75.12.0"
        # (26 unchanged attributes hidden)
    }

  # module.services.helm_release.prometheus_operator_crds will be updated in-place
  ~ resource "helm_release" "prometheus_operator_crds" {
      ~ id                         = "prometheus-operator-crds" -> (known after apply)
      ~ metadata                   = {
          ~ app_version    = "v0.84.0" -> (known after apply)
          ~ chart          = "prometheus-operator-crds" -> (known after apply)
          ~ first_deployed = 1744372023 -> (known after apply)
          ~ last_deployed  = 1753097435 -> (known after apply)
          ~ name           = "prometheus-operator-crds" -> (known after apply)
          ~ namespace      = "default" -> (known after apply)
          + notes          = (known after apply)
          ~ revision       = 4 -> (known after apply)
          ~ values         = jsonencode({}) -> (known after apply)
          ~ version        = "22.0.0" -> (known after apply)
        } -> (known after apply)
        name                       = "prometheus-operator-crds"
      ~ version                    = "22.0.0" -> "22.0.1"
        # (26 unchanged attributes hidden)
    }

Plan: 1 to add, 5 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @renovate[bot] |
| Action | `pull_request` |
| Working Directory | `./infrastructure/adminservices-test/k6tests-rg` |
| State File | `github.com/altinn/altinn-platform/environments/test/k6tests-rg.tfstate` |
| Plan File | `github.com_altinn_altinn-platform_environments_test_k6tests-rg.tfstate.tfplan`